#### 🛠 Terraform Plan Result

<details><summary>Click to expand</summary>

```hcl
aws_cloudfront_origin_access_control.oac: Refreshing state... [id=E3NB910QFOKXZT]
aws_s3_bucket.site: Refreshing state... [id=crimsonherb.me]
aws_s3_bucket_ownership_controls.site_ownership_control: Refreshing state... [id=crimsonherb.me]
aws_s3_bucket_public_access_block.site_block: Refreshing state... [id=crimsonherb.me]
aws_s3_bucket_versioning.site_versioning: Refreshing state... [id=crimsonherb.me]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2EHDV0XZ0MEHJ]
aws_s3_bucket_policy.site_policy: Refreshing state... [id=crimsonherb.me]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_dns_record.site_cname will be created
  + resource "cloudflare_dns_record" "site_cname" {
      + comment             = "Points to cloudfront"
      + comment_modified_on = (known after apply)
      + content             = "d3b6q7qkphvtrp.cloudfront.net"
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "crimsonherb.me"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "fc23702f67aed4980eb3c83c5a1d716f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Triggered by @crimsonherb on PR #16*